#!/bin/bash
#Menu

echo -e "* 1         : ดูรายการต่างมีดังนี้นะครับพี่"
echo -e "             จัดทำโดย GM CHOKE "

echo -e "=============== เกี่ยวกับสร้างบัญชี SSH & OPEN VPN ============="
echo -e "* 2         : สร้างบัญชี SSH & OpenVPN"
echo -e "* 3         : สร้างบัญชีทดลอง 1 ชั่วโมง SSH & OpenVPN"
echo -e "========================================================="

echo -e "=============== เกี่ยวกับลบบัญชี SSH & OPEN VPN =============="
echo -e "* 4         : ลบรายชื่อ SSH & OPEN VPN"
echo -e "* 5         : ลบรายชื่ออัติโนมัตตามวันที่หมดอายุ"
echo -e "* 14        : แก้ไขรายชื่อและแก้ไขรหัสผ่านครับ
echo -e "========================================================="

echo -e "=============== เกี่ยวกับแสดงรายชื่อ SSH & OPEN VPN ==========="
echo -e "* 6         : แสดงรายชื่อที่ออนไลน์ SSH & OPEN VPN"
echo -e "* 7         : แสดงรายชื่อทั้งหมด SSH & OpenVPN"
echo -e "========================================================="

echo -e "=============== เกี่ยวกับการปลดแบนรายชื่อ SSH & OPEN VPN ======"
echo -e "* 8         : แบนรายชื่อ SSH & OPEN VPN"
echo -e "* 9         : ปลดแบนรายชื่อ SSH & OPEN VPN"
echo -e "========================================================="

echo -e "================ เกี่ยวกับรีระบบ VPS ========================="
echo -e "* 10        : รีระบบทั้งหมด restart service dropbear, webmin ,squid3, OpenVPN dan SSH"
echo -e "* 11        : ตั้งเวลารีบูทระบบ VPS"
echo -e "========================================================="

echo -e "================ เกี่ยวกับ เทสสปีดความเร็ว ====================="
echo -e "* 12        : ทดสอบเทสสปีด VPS"
echo -e "========================================================="

echo -e "================ เกี่ยวกับ RAM, ดูแบนวิส,แบ็คบัพข้อมูล ==========="
echo -e "* 13        : ดูการใช้ RAM ของเซิร์ฟเวอร์"
echo -e ""
echo -e ""
echo -e "========================================================="

echo -e "================ เกี่ยวกับดูการติดตั้งระบบ VPS,และออกจากใช้งานระบบ ="
echo -e "* about     : ดูรายละเอียดการติดตั้งของระบบ"
echo -e "* exit      : ออกจากระบบ keluar dari Putty/Connecbot/"
echo -e "========================================================="


echo -e "            สนใจติดต่อ Facebook: nipon kaewtes ,ID Line: nipon24082535"
echo -e "            เบอร์โทรศพท์ 0940749370-โชค"
echo -e " ===========   ===========      ===============              ==============   =======   ===      ===   ===     === "  
echo -e " =====  ====   ====   ====      ========   ==  "             "  =======    "  : :===  " :  :    :  :   : : :   : : "
echo -e "    "   "         "   "                "  "  "  "            "  "      "   "  : :  :  "  :  :  :  :    : :: :  : : "
echo -e "    "   "         "   "               "  "    "  "           "  "======"   "  : ===!  "   :  ::  :     : : : : : : "
echo -e "    "   "========="   "              "  =======   "          "  ========= "   : ======"    :    :      : :  : :: : "
echo -e "    "    =========    "             "  =========   "         "  "             : :           :  :       :=:   :___| "
echo -e "    "   "         "   "            "  "         "   "        "  "             : :           :  :"
echo -e "    "   "         "   "           "  "           "   "       "  "             :__           :__:       ___________ "
echo -e " ====   ====   ====   =====   ====   =====  =======   "      "   =====                                 :  :_______ "
echo -e " ===========   ============   =====  =====  ===========      ========!                                 :  :        "
echo -e "                                                                                                       :  ________ "
echo -e "                                                                                                       :  ________ "
echo -e "                                                                                                       :  :"
echo -e "                                                                                                       :  ________ "
echo -e "                                                                                                       ___________ "
echo -e "                                                                                                      ____    ____ "
echo -e "                                                                                                      :  :    :  : "
echo -e "                                                                                                       :  :  :  :  "
echo -e "                                                                                                         :    :    "
echo -e "                                                                                                          :  :     "
echo -e "                                                                                                          :__:     "








